Server-test/Storage/fio-Log/StorageStress.log
K1-4M-read: (g=0): rw=read, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=psync, iodepth=1
...
K2-4M-read: (g=1): rw=read, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=psync, iodepth=1
...
K3-4M-read: (g=2): rw=read, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=psync, iodepth=1
...
K4-4M-read: (g=3): rw=read, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=psync, iodepth=1
...
K5-4M-read: (g=4): rw=read, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=psync, iodepth=1
...
K6-4M-read: (g=5): rw=read, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=psync, iodepth=1
...
K7-4M-read: (g=6): rw=read, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=psync, iodepth=1
...
K8-4M-read: (g=7): rw=read, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=psync, iodepth=1
...
K1-4M-write: (g=8): rw=write, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=psync, iodepth=1
...
K2-4M-write: (g=9): rw=write, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=psync, iodepth=1
...
K3-4M-write: (g=10): rw=write, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=psync, iodepth=1
...
K4-4M-write: (g=11): rw=write, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=psync, iodepth=1
...
K5-4M-write: (g=12): rw=write, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=psync, iodepth=1
...
K6-4M-write: (g=13): rw=write, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=psync, iodepth=1
...
K7-4M-write: (g=14): rw=write, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=psync, iodepth=1
...
K8-4M-write: (g=15): rw=write, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=psync, iodepth=1
...
fio-3.19
Starting 2048 threads

K1-4M-read: (groupid=0, jobs=128): err= 0: pid=23828: Thu Aug 13 16:02:17 2020
  read: IOPS=771, BW=3087MiB/s (3236MB/s)(6812MiB/2207msec)
    clat (usec): min=1362, max=294298, avg=154511.05, stdev=51412.28
     lat (usec): min=1362, max=294299, avg=154511.33, stdev=51412.26
    clat percentiles (usec):
     |  1.00th=[  1369],  5.00th=[ 73925], 10.00th=[ 73925], 20.00th=[111674],
     | 30.00th=[147850], 40.00th=[147850], 50.00th=[147850], 60.00th=[183501],
     | 70.00th=[185598], 80.00th=[185598], 90.00th=[223347], 95.00th=[223347],
     | 99.00th=[258999], 99.50th=[261096], 99.90th=[295699], 99.95th=[295699],
     | 99.99th=[295699]
   bw (  MiB/s): min= 2599, max= 3650, per=100.00%, avg=3101.02, stdev= 4.00, samples=409
   iops        : min=  557, max=  796, avg=668.42, stdev= 0.93, samples=409
  lat (msec)   : 2=1.23%, 4=0.06%, 20=0.06%, 50=0.76%, 100=11.51%
  lat (msec)   : 250=82.38%, 500=3.99%
  cpu          : usr=0.00%, sys=0.94%, ctx=1743, majf=0, minf=6
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1703,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
K2-4M-read: (groupid=1, jobs=128): err= 0: pid=24017: Thu Aug 13 16:02:17 2020
  read: IOPS=805, BW=3223MiB/s (3380MB/s)(7136MiB/2214msec)
    clat (usec): min=1367, max=363821, avg=146939.74, stdev=81704.98
     lat (usec): min=1367, max=363821, avg=146940.06, stdev=81704.97
    clat percentiles (usec):
     |  1.00th=[  1385],  5.00th=[ 13304], 10.00th=[ 49546], 20.00th=[ 72877],
     | 30.00th=[108528], 40.00th=[109577], 50.00th=[143655], 60.00th=[145753],
     | 70.00th=[179307], 80.00th=[181404], 90.00th=[252707], 95.00th=[350225],
     | 99.00th=[362808], 99.50th=[362808], 99.90th=[362808], 99.95th=[362808],
     | 99.99th=[362808]
   bw (  MiB/s): min= 2628, max= 3622, per=96.47%, avg=3109.33, stdev= 3.61, samples=385
   iops        : min=  560, max=  784, avg=669.50, stdev= 0.85, samples=385
  lat (msec)   : 2=1.07%, 4=1.35%, 10=1.91%, 20=1.01%, 50=6.50%
  lat (msec)   : 100=11.72%, 250=64.24%, 500=12.22%
  cpu          : usr=0.00%, sys=0.78%, ctx=1813, majf=0, minf=0
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1784,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
K3-4M-read: (groupid=2, jobs=128): err= 0: pid=24165: Thu Aug 13 16:02:17 2020
  read: IOPS=468, BW=1873MiB/s (1964MB/s)(4252MiB/2270msec)
    clat (usec): min=1894, max=412223, avg=252617.28, stdev=81428.97
     lat (usec): min=1894, max=412223, avg=252617.74, stdev=81428.92
    clat percentiles (msec):
     |  1.00th=[    7],  5.00th=[   85], 10.00th=[  165], 20.00th=[  180],
     | 30.00th=[  222], 40.00th=[  228], 50.00th=[  271], 60.00th=[  279],
     | 70.00th=[  284], 80.00th=[  334], 90.00th=[  342], 95.00th=[  380],
     | 99.00th=[  409], 99.50th=[  409], 99.90th=[  414], 99.95th=[  414],
     | 99.99th=[  414]
   bw (  MiB/s): min= 1260, max= 2353, per=97.73%, avg=1830.56, stdev= 4.00, samples=430
   iops        : min=  227, max=  463, avg=344.50, stdev= 0.92, samples=430
  lat (msec)   : 2=0.09%, 10=1.13%, 100=4.89%, 250=37.63%, 500=56.26%
  cpu          : usr=0.00%, sys=0.47%, ctx=1100, majf=0, minf=0
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1063,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
K4-4M-read: (groupid=3, jobs=128): err= 0: pid=24301: Thu Aug 13 16:02:17 2020
  read: IOPS=783, BW=3135MiB/s (3287MB/s)(6824MiB/2177msec)
    clat (usec): min=1364, max=340408, avg=154017.38, stdev=60481.61
     lat (usec): min=1364, max=340408, avg=154017.70, stdev=60481.57
    clat percentiles (usec):
     |  1.00th=[  1385],  5.00th=[ 40633], 10.00th=[ 95945], 20.00th=[107480],
     | 30.00th=[131597], 40.00th=[143655], 50.00th=[160433], 60.00th=[168821],
     | 70.00th=[179307], 80.00th=[191890], 90.00th=[214959], 95.00th=[270533],
     | 99.00th=[325059], 99.50th=[333448], 99.90th=[341836], 99.95th=[341836],
     | 99.99th=[341836]
   bw (  MiB/s): min= 2337, max= 3707, per=97.91%, avg=3069.07, stdev= 6.21, samples=417
   iops        : min=  489, max=  813, avg=660.25, stdev= 1.53, samples=417
  lat (msec)   : 2=1.35%, 4=0.41%, 10=0.06%, 20=0.23%, 50=4.10%
  lat (msec)   : 100=9.50%, 250=76.67%, 500=7.68%
  cpu          : usr=0.00%, sys=0.71%, ctx=1739, majf=0, minf=0
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1706,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
K5-4M-read: (groupid=4, jobs=128): err= 0: pid=24464: Thu Aug 13 16:02:17 2020
  read: IOPS=635, BW=2543MiB/s (2666MB/s)(5696MiB/2240msec)
    clat (usec): min=1367, max=413660, avg=190347.06, stdev=80387.61
     lat (usec): min=1367, max=413661, avg=190347.31, stdev=80387.57
    clat percentiles (msec):
     |  1.00th=[    3],  5.00th=[   34], 10.00th=[   37], 20.00th=[  155],
     | 30.00th=[  169], 40.00th=[  190], 50.00th=[  192], 60.00th=[  213],
     | 70.00th=[  218], 80.00th=[  247], 90.00th=[  279], 95.00th=[  334],
     | 99.00th=[  363], 99.50th=[  384], 99.90th=[  414], 99.95th=[  414],
     | 99.99th=[  414]
   bw (  MiB/s): min= 1952, max= 2995, per=97.53%, avg=2479.94, stdev= 4.14, samples=432
   iops        : min=  395, max=  629, avg=511.08, stdev= 0.98, samples=432
  lat (msec)   : 2=0.91%, 4=0.77%, 20=0.21%, 50=11.59%, 250=67.56%
  lat (msec)   : 500=18.96%
  cpu          : usr=0.00%, sys=0.62%, ctx=1446, majf=0, minf=0
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1424,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
K6-4M-read: (groupid=5, jobs=128): err= 0: pid=24612: Thu Aug 13 16:02:17 2020
  read: IOPS=771, BW=3088MiB/s (3238MB/s)(6744MiB/2184msec)
    clat (msec): min=11, max=264, avg=156.46, stdev=49.11
     lat (msec): min=11, max=264, avg=156.46, stdev=49.11
    clat percentiles (msec):
     |  1.00th=[   50],  5.00th=[   66], 10.00th=[   77], 20.00th=[  113],
     | 30.00th=[  150], 40.00th=[  150], 50.00th=[  150], 60.00th=[  186],
     | 70.00th=[  188], 80.00th=[  190], 90.00th=[  226], 95.00th=[  226],
     | 99.00th=[  264], 99.50th=[  264], 99.90th=[  266], 99.95th=[  266],
     | 99.99th=[  266]
   bw (  MiB/s): min= 2665, max= 3612, per=100.00%, avg=3095.66, stdev= 3.50, samples=434
   iops        : min=  579, max=  790, avg=667.33, stdev= 0.81, samples=434
  lat (msec)   : 20=0.18%, 50=2.31%, 100=9.31%, 250=86.89%, 500=1.30%
  cpu          : usr=0.00%, sys=0.75%, ctx=1720, majf=0, minf=0
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1686,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
K7-4M-read: (groupid=6, jobs=128): err= 0: pid=24746: Thu Aug 13 16:02:17 2020
  read: IOPS=515, BW=2062MiB/s (2162MB/s)(4620MiB/2241msec)
    clat (msec): min=10, max=390, avg=231.15, stdev=75.70
     lat (msec): min=10, max=390, avg=231.16, stdev=75.70
    clat percentiles (msec):
     |  1.00th=[   65],  5.00th=[  108], 10.00th=[  118], 20.00th=[  163],
     | 30.00th=[  184], 40.00th=[  218], 50.00th=[  226], 60.00th=[  257],
     | 70.00th=[  279], 80.00th=[  317], 90.00th=[  334], 95.00th=[  338],
     | 99.00th=[  376], 99.50th=[  384], 99.90th=[  393], 99.95th=[  393],
     | 99.99th=[  393]
   bw (  MiB/s): min= 1514, max= 2516, per=97.57%, avg=2011.50, stdev= 3.70, samples=424
   iops        : min=  286, max=  509, avg=392.33, stdev= 0.87, samples=424
  lat (msec)   : 20=0.09%, 100=4.16%, 250=54.89%, 500=40.87%
  cpu          : usr=0.00%, sys=0.51%, ctx=1179, majf=0, minf=0
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1155,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
K8-4M-read: (groupid=7, jobs=128): err= 0: pid=24882: Thu Aug 13 16:02:17 2020
  read: IOPS=773, BW=3093MiB/s (3243MB/s)(6816MiB/2204msec)
    clat (usec): min=1360, max=466581, avg=154545.99, stdev=68018.76
     lat (usec): min=1360, max=466581, avg=154546.29, stdev=68018.74
    clat percentiles (msec):
     |  1.00th=[    8],  5.00th=[   47], 10.00th=[   47], 20.00th=[  112],
     | 30.00th=[  113], 40.00th=[  148], 50.00th=[  150], 60.00th=[  186],
     | 70.00th=[  188], 80.00th=[  188], 90.00th=[  226], 95.00th=[  264],
     | 99.00th=[  376], 99.50th=[  405], 99.90th=[  456], 99.95th=[  468],
     | 99.99th=[  468]
   bw (  MiB/s): min= 2496, max= 3729, per=100.00%, avg=3103.62, stdev= 5.17, samples=384
   iops        : min=  522, max=  817, avg=671.67, stdev= 1.25, samples=384
  lat (msec)   : 2=1.00%, 10=0.06%, 20=0.18%, 50=9.74%, 100=6.81%
  lat (msec)   : 250=74.82%, 500=7.39%
  cpu          : usr=0.00%, sys=0.86%, ctx=1783, majf=0, minf=32904
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1704,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
K1-4M-write: (groupid=8, jobs=128): err= 0: pid=25016: Thu Aug 13 16:02:17 2020
  write: IOPS=259, BW=1037MiB/s (1087MB/s)(2592MiB/2500msec)
    clat (usec): min=1516, max=885798, avg=432136.00, stdev=170331.08
     lat (usec): min=1806, max=886244, avg=432450.61, stdev=170336.03
    clat percentiles (msec):
     |  1.00th=[    3],  5.00th=[    8], 10.00th=[  134], 20.00th=[  321],
     | 30.00th=[  418], 40.00th=[  426], 50.00th=[  443], 60.00th=[  518],
     | 70.00th=[  531], 80.00th=[  542], 90.00th=[  558], 95.00th=[  642],
     | 99.00th=[  869], 99.50th=[  877], 99.90th=[  885], 99.95th=[  885],
     | 99.99th=[  885]
   bw (  MiB/s): min=  903, max= 1253, per=100.00%, avg=1089.82, stdev= 2.00, samples=408
   iops        : min=  136, max=  186, avg=157.75, stdev= 0.44, samples=408
  lat (msec)   : 2=0.77%, 4=2.01%, 10=2.93%, 20=0.31%, 250=5.56%
  lat (msec)   : 500=46.76%, 750=39.20%, 1000=2.47%
  cpu          : usr=0.06%, sys=0.25%, ctx=769, majf=0, minf=0
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,648,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
K2-4M-write: (groupid=9, jobs=128): err= 0: pid=25153: Thu Aug 13 16:02:17 2020
  write: IOPS=235, BW=941MiB/s (987MB/s)(2376MiB/2524msec)
    clat (msec): min=113, max=662, avg=466.93, stdev=109.00
     lat (msec): min=114, max=662, avg=467.26, stdev=109.00
    clat percentiles (msec):
     |  1.00th=[  125],  5.00th=[  309], 10.00th=[  330], 20.00th=[  418],
     | 30.00th=[  422], 40.00th=[  435], 50.00th=[  443], 60.00th=[  518],
     | 70.00th=[  531], 80.00th=[  542], 90.00th=[  634], 95.00th=[  642],
     | 99.00th=[  659], 99.50th=[  659], 99.90th=[  659], 99.95th=[  659],
     | 99.99th=[  659]
   bw (  MiB/s): min=  862, max= 1213, per=100.00%, avg=1047.15, stdev= 1.89, samples=414
   iops        : min=  132, max=  176, avg=149.00, stdev= 0.40, samples=414
  lat (msec)   : 250=3.87%, 500=54.21%, 750=41.92%
  cpu          : usr=0.06%, sys=0.21%, ctx=652, majf=0, minf=0
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,594,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
K3-4M-write: (groupid=10, jobs=128): err= 0: pid=25298: Thu Aug 13 16:02:17 2020
  write: IOPS=242, BW=972MiB/s (1019MB/s)(2384MiB/2453msec)
    clat (msec): min=127, max=665, avg=462.26, stdev=108.26
     lat (msec): min=128, max=665, avg=462.59, stdev=108.26
    clat percentiles (msec):
     |  1.00th=[  136],  5.00th=[  161], 10.00th=[  326], 20.00th=[  414],
     | 30.00th=[  426], 40.00th=[  435], 50.00th=[  447], 60.00th=[  523],
     | 70.00th=[  531], 80.00th=[  542], 90.00th=[  558], 95.00th=[  634],
     | 99.00th=[  659], 99.50th=[  667], 99.90th=[  667], 99.95th=[  667],
     | 99.99th=[  667]
   bw (  MiB/s): min=  871, max= 1188, per=100.00%, avg=1044.96, stdev= 1.63, samples=415
   iops        : min=  136, max=  170, avg=149.42, stdev= 0.33, samples=415
  lat (msec)   : 250=5.20%, 500=46.64%, 750=48.15%
  cpu          : usr=0.06%, sys=0.21%, ctx=643, majf=0, minf=0
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,596,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
K4-4M-write: (groupid=11, jobs=128): err= 0: pid=25435: Thu Aug 13 16:02:17 2020
  write: IOPS=237, BW=950MiB/s (996MB/s)(2372MiB/2496msec)
    clat (msec): min=121, max=673, avg=466.66, stdev=108.97
     lat (msec): min=121, max=674, avg=466.99, stdev=108.97
    clat percentiles (msec):
     |  1.00th=[  128],  5.00th=[  309], 10.00th=[  321], 20.00th=[  414],
     | 30.00th=[  418], 40.00th=[  430], 50.00th=[  447], 60.00th=[  518],
     | 70.00th=[  531], 80.00th=[  542], 90.00th=[  625], 95.00th=[  642],
     | 99.00th=[  667], 99.50th=[  667], 99.90th=[  676], 99.95th=[  676],
     | 99.99th=[  676]
   bw (  MiB/s): min=  867, max= 1197, per=100.00%, avg=1045.47, stdev= 1.82, samples=400
   iops        : min=  133, max=  172, avg=148.83, stdev= 0.37, samples=400
  lat (msec)   : 250=3.54%, 500=50.59%, 750=45.87%
  cpu          : usr=0.06%, sys=0.21%, ctx=677, majf=0, minf=0
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,593,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
K5-4M-write: (groupid=12, jobs=128): err= 0: pid=25572: Thu Aug 13 16:02:17 2020
  write: IOPS=244, BW=979MiB/s (1027MB/s)(2400MiB/2451msec)
    clat (msec): min=3, max=826, avg=462.15, stdev=161.33
     lat (msec): min=3, max=827, avg=462.47, stdev=161.32
    clat percentiles (msec):
     |  1.00th=[    4],  5.00th=[  150], 10.00th=[  226], 20.00th=[  342],
     | 30.00th=[  430], 40.00th=[  443], 50.00th=[  460], 60.00th=[  485],
     | 70.00th=[  558], 80.00th=[  584], 90.00th=[  667], 95.00th=[  709],
     | 99.00th=[  810], 99.50th=[  818], 99.90th=[  827], 99.95th=[  827],
     | 99.99th=[  827]
   bw (  MiB/s): min=  913, max= 1193, per=100.00%, avg=1064.51, stdev= 1.54, samples=399
   iops        : min=  140, max=  172, avg=151.67, stdev= 0.33, samples=399
  lat (msec)   : 4=1.17%, 10=0.50%, 20=0.17%, 50=0.17%, 250=9.00%
  lat (msec)   : 500=50.17%, 750=35.17%, 1000=3.67%
  cpu          : usr=0.06%, sys=0.21%, ctx=710, majf=0, minf=0
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,600,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
K6-4M-write: (groupid=13, jobs=128): err= 0: pid=25707: Thu Aug 13 16:02:17 2020
  write: IOPS=240, BW=963MiB/s (1009MB/s)(2392MiB/2485msec)
    clat (msec): min=3, max=780, avg=459.30, stdev=133.21
     lat (msec): min=3, max=780, avg=459.61, stdev=133.22
    clat percentiles (msec):
     |  1.00th=[    7],  5.00th=[  136], 10.00th=[  326], 20.00th=[  414],
     | 30.00th=[  422], 40.00th=[  430], 50.00th=[  439], 60.00th=[  451],
     | 70.00th=[  523], 80.00th=[  542], 90.00th=[  558], 95.00th=[  735],
     | 99.00th=[  768], 99.50th=[  776], 99.90th=[  785], 99.95th=[  785],
     | 99.99th=[  785]
   bw (  MiB/s): min=  876, max= 1191, per=100.00%, avg=1040.29, stdev= 1.75, samples=411
   iops        : min=  132, max=  171, avg=145.92, stdev= 0.37, samples=411
  lat (msec)   : 4=0.33%, 10=1.51%, 20=0.33%, 50=0.17%, 100=0.17%
  lat (msec)   : 250=2.84%, 500=56.35%, 750=35.95%, 1000=2.34%
  cpu          : usr=0.06%, sys=0.20%, ctx=660, majf=0, minf=0
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,598,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
K7-4M-write: (groupid=14, jobs=128): err= 0: pid=25844: Thu Aug 13 16:02:17 2020
  write: IOPS=238, BW=956MiB/s (1002MB/s)(2440MiB/2553msec)
    clat (msec): min=124, max=681, avg=463.87, stdev=118.10
     lat (msec): min=124, max=682, avg=464.21, stdev=118.10
    clat percentiles (msec):
     |  1.00th=[  129],  5.00th=[  213], 10.00th=[  321], 20.00th=[  422],
     | 30.00th=[  430], 40.00th=[  439], 50.00th=[  451], 60.00th=[  527],
     | 70.00th=[  542], 80.00th=[  550], 90.00th=[  567], 95.00th=[  651],
     | 99.00th=[  676], 99.50th=[  676], 99.90th=[  684], 99.95th=[  684],
     | 99.99th=[  684]
   bw (  MiB/s): min=  873, max= 1177, per=100.00%, avg=1042.18, stdev= 1.56, samples=418
   iops        : min=  137, max=  169, avg=148.83, stdev= 0.34, samples=418
  lat (msec)   : 250=7.87%, 500=50.16%, 750=41.97%
  cpu          : usr=0.06%, sys=0.22%, ctx=696, majf=0, minf=0
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,610,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
K8-4M-write: (groupid=15, jobs=128): err= 0: pid=25981: Thu Aug 13 16:02:17 2020
  write: IOPS=236, BW=946MiB/s (992MB/s)(2404MiB/2540msec)
    clat (msec): min=98, max=680, avg=467.86, stdev=113.48
     lat (msec): min=99, max=681, avg=468.20, stdev=113.47
    clat percentiles (msec):
     |  1.00th=[  138],  5.00th=[  150], 10.00th=[  330], 20.00th=[  422],
     | 30.00th=[  435], 40.00th=[  447], 50.00th=[  456], 60.00th=[  527],
     | 70.00th=[  542], 80.00th=[  558], 90.00th=[  567], 95.00th=[  634],
     | 99.00th=[  667], 99.50th=[  684], 99.90th=[  684], 99.95th=[  684],
     | 99.99th=[  684]
   bw (  MiB/s): min=  876, max= 1189, per=100.00%, avg=1049.84, stdev= 1.73, samples=418
   iops        : min=  136, max=  170, avg=149.50, stdev= 0.36, samples=418
  lat (msec)   : 100=0.33%, 250=5.49%, 500=50.42%, 750=43.76%
  cpu          : usr=0.07%, sys=0.20%, ctx=668, majf=0, minf=2801
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,601,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=3087MiB/s (3236MB/s), 3087MiB/s-3087MiB/s (3236MB/s-3236MB/s), io=6812MiB (7143MB), run=2207-2207msec

Run status group 1 (all jobs):
   READ: bw=3223MiB/s (3380MB/s), 3223MiB/s-3223MiB/s (3380MB/s-3380MB/s), io=7136MiB (7483MB), run=2214-2214msec

Run status group 2 (all jobs):
   READ: bw=1873MiB/s (1964MB/s), 1873MiB/s-1873MiB/s (1964MB/s-1964MB/s), io=4252MiB (4459MB), run=2270-2270msec

Run status group 3 (all jobs):
   READ: bw=3135MiB/s (3287MB/s), 3135MiB/s-3135MiB/s (3287MB/s-3287MB/s), io=6824MiB (7155MB), run=2177-2177msec

Run status group 4 (all jobs):
   READ: bw=2543MiB/s (2666MB/s), 2543MiB/s-2543MiB/s (2666MB/s-2666MB/s), io=5696MiB (5973MB), run=2240-2240msec

Run status group 5 (all jobs):
   READ: bw=3088MiB/s (3238MB/s), 3088MiB/s-3088MiB/s (3238MB/s-3238MB/s), io=6744MiB (7072MB), run=2184-2184msec

Run status group 6 (all jobs):
   READ: bw=2062MiB/s (2162MB/s), 2062MiB/s-2062MiB/s (2162MB/s-2162MB/s), io=4620MiB (4844MB), run=2241-2241msec

Run status group 7 (all jobs):
   READ: bw=3093MiB/s (3243MB/s), 3093MiB/s-3093MiB/s (3243MB/s-3243MB/s), io=6816MiB (7147MB), run=2204-2204msec

Run status group 8 (all jobs):
  WRITE: bw=1037MiB/s (1087MB/s), 1037MiB/s-1037MiB/s (1087MB/s-1087MB/s), io=2592MiB (2718MB), run=2500-2500msec

Run status group 9 (all jobs):
  WRITE: bw=941MiB/s (987MB/s), 941MiB/s-941MiB/s (987MB/s-987MB/s), io=2376MiB (2491MB), run=2524-2524msec

Run status group 10 (all jobs):
  WRITE: bw=972MiB/s (1019MB/s), 972MiB/s-972MiB/s (1019MB/s-1019MB/s), io=2384MiB (2500MB), run=2453-2453msec

Run status group 11 (all jobs):
  WRITE: bw=950MiB/s (996MB/s), 950MiB/s-950MiB/s (996MB/s-996MB/s), io=2372MiB (2487MB), run=2496-2496msec

Run status group 12 (all jobs):
  WRITE: bw=979MiB/s (1027MB/s), 979MiB/s-979MiB/s (1027MB/s-1027MB/s), io=2400MiB (2517MB), run=2451-2451msec

Run status group 13 (all jobs):
  WRITE: bw=963MiB/s (1009MB/s), 963MiB/s-963MiB/s (1009MB/s-1009MB/s), io=2392MiB (2508MB), run=2485-2485msec

Run status group 14 (all jobs):
  WRITE: bw=956MiB/s (1002MB/s), 956MiB/s-956MiB/s (1002MB/s-1002MB/s), io=2440MiB (2559MB), run=2553-2553msec

Run status group 15 (all jobs):
  WRITE: bw=946MiB/s (992MB/s), 946MiB/s-946MiB/s (992MB/s-992MB/s), io=2404MiB (2521MB), run=2540-2540msec

Disk stats (read/write):
  nvme0n1: ios=75982/32190, merge=0/0, ticks=10916183/12059276, in_queue=23109837, util=21.17%
  nvme1n1: ios=82273/31385, merge=0/0, ticks=10893249/12156796, in_queue=23167197, util=21.13%
  nvme2n1: ios=51744/30097, merge=0/0, ticks=11403606/11306206, in_queue=23247449, util=20.44%
  nvme3n1: ios=75585/30886, merge=0/0, ticks=11341321/12002946, in_queue=23454521, util=20.32%
  nvme4n1: ios=65026/30686, merge=0/0, ticks=12155254/11598409, in_queue=23981896, util=20.69%
  nvme5n1: ios=77732/31520, merge=0/0, ticks=10885225/12236286, in_queue=23260818, util=20.10%
  nvme6n1: ios=52032/30413, merge=0/0, ticks=11310071/11741976, in_queue=23480040, util=19.91%
  nvme7n1: ios=78112/30396, merge=0/0, ticks=11112491/11775348, in_queue=23156181, util=19.45%
fio: file hash not empty on exit